InformationRegisters/ЗадачиОбратныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиОбратныйЗвонок</Name>
			<Comment>Задачи на обратный звонок</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокИнициатор</Name>
					<Comment>Сигнатура непринятого звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой необходимо исполнить задачу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоИнициатор</Name>
					<Comment>MessageID письма эл. почты для почтового сообщения/ имя сайта для автозвонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПлан</Name>
					<Comment>Предполагаемый исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоИсполнительПлан</Name>
					<Comment>Предполагаемый  соисполнитель задачи (напр. непосредственный руководитель)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоИсполнителиПлан</Name>
					<Comment>Адресаты из поля копия, из их адресов эл. почты получены ФИО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Сигнатура интернет-заявки, по которой задача по интернет-заявке закрылась и была создана задача на обратный звонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиОбратныйЗвонок/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Сформируем заголовок и доступность формы
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.Заголовок = "Задача по обратному звонку от ";
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + СокрЛП(Формат(Запись.ДатаПостановки,"ДЛФ=DD"));
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ", " + Конвертация.ДеньНеделиПрописью(Запись.ДатаПостановки);
	ЭтаФорма.ТолькоПросмотр = Истина;

// Скроем группы отвечающие за состояние исполнения задачи
//-------------------------------------------------------------------------------------------------
	Элементы.ГруппаЗакрытаПользователь.Видимость = Ложь;
	Элементы.ГруппаЗакрытаЗвонок.Видимость = Ложь;
	Элементы.ГруппаОткрыта.Видимость = Ложь;

// Если задача открыта (неисполнена)
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(Запись.ДатаЗакрытия)) Тогда
		Темп = "Ответственный за исполнение " + СокрЛП(Запись.Исполнитель);
		Элементы.НадписьОткрыта.Заголовок = СокрЛП(Темп);
		Элементы.ГруппаОткрыта.Видимость = Истина;

// Если задача закрыта (исполнена)
//-------------------------------------------------------------------------------------------------
	Иначе
		Если (ТипЗнч(Запись.Исполнитель) = Тип("СправочникСсылка.Пользователи")) Тогда
			Темп = "Закрыта вручную пользователем: " + СокрЛП(Запись.Исполнитель);
			Темп = Темп + ", " + СокрЛП(Формат(Запись.ДатаЗакрытия,"ДЛФ=DDT"));
			Элементы.НадписьЗакрытаПользователь.Заголовок = СокрЛП(Темп);
			Элементы.ГруппаЗакрытаПользователь.Видимость = Истина;
		ИначеЕсли (ТипЗнч(Запись.Исполнитель) = Тип("СправочникСсылка.ТелВнутренние")) Тогда
			Темп = "Закрыта автоматически звонком: " + СокрЛП(Запись.Исполнитель);
			Темп = Темп + ", " + СокрЛП(Формат(Запись.ДатаЗакрытия,"ДЛФ=DDT"));
			Элементы.НадписьЗакрытаЗвонок.Заголовок = СокрЛП(Темп);
			Элементы.ГруппаЗакрытаЗвонок.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьЗакрытаЗвонокНажатие(Элемент)

// Откроем форму звонка, которым исполнена задача
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Запись.ЗвонокЗакрытия)) Тогда
		Попытка
			СтрКлюча = Новый Структура("Сигнатура",СокрЛП(Запись.ЗвонокЗакрытия));
			КлючЗаписи = ЗначенияСервера.ПолучитьКлючЗаписи("Звонки",СтрКлюча);
			ОткрытьЗначение(КлючЗаписи);
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
